ИБ1265/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлатыЕжемесечно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИБ1265/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ИБ1265/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ доработка диплома 
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ВывестиРеквизитыПрограммноНаФорму();
	КонецЕсли;	
	//-- конец доработки диплома	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++ доработка диплома	
	ВывестиРеквизитыПрограммноНаФорму();
	//-- конец доработки диплома	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРеквизитыПрограммноНаФорму()
   //++ доработка диплома
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ГруппаСрокДоговора = Элементы.Добавить("ГруппаСрокДоговора", Тип("ГруппаФормы"));
		ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСрокДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		РеквизитДатаНачала = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора);
		РеквизитДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		РеквизитДатаНачала.Заголовок = "Дата начала действия договора";
		
		РеквизитДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора); 
		РеквизитДатаОкончания.Вид =      ВидПоляФормы.ПолеВвода;
		РеквизитДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		РеквизитДатаОкончания.Заголовок = "Дата окончания действия договора";
		
		ГруппаСтоимость = Элементы.Добавить("ГруппаСтоимость", Тип("ГруппаФормы"));
		ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;		

		РеквизитСуммаАбПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлатыЕжемесечно", Тип("ПолеФормы"), ГруппаСтоимость);
		РеквизитСуммаАбПлаты.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитСуммаАбПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлатыЕжемесечно";
		РеквизитСуммаАбПлаты.Заголовок = "Сумма абонентской платы (ежемесечно)";
		
		РеквизитСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧасаРабот", Тип("ПолеФормы"), ГруппаСтоимость);
		РеквизитСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРабот";
		РеквизитСтоимостьЧаса.Заголовок = "Стоимость часа работ";
		
	КонецЕсли;	
	//-- конец доработки диплома	
КонецПроцедуры	


#КонецОбласти
